{
  "backend/career-path.mo": "Defines data types for career paths, profiles, assessments, analytics, job recommendations, and related structures used across the backend.",
  "backend/main.mo": "Main actor implementing core job platform types and logic, including profiles, jobs, applications, messaging, scheduling, notifications, and storage integration.",
  "backend/migration.mo": "Migration module upgrading user profile customization to include an optional profile picture field while preserving existing data.",
  "feature_evidence.json": "Feature evidence report linking UI profile picture enhancements to relevant frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables, dark mode settings, and base styles.",
  "frontend/index.html": "Main HTML entry point mounting the React application.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup flow, dashboard rendering, and theme/query providers.",
  "frontend/src/components/admin/ActivityMonitorTab.tsx": "Admin UI stub showing placeholder for future real-time activity monitoring.",
  "frontend/src/components/admin/AdminAIInsightsTab.tsx": "Admin dashboard rendering various charts using mock data to display AI-driven insights.",
  "frontend/src/components/admin/CertificationsTab.tsx": "Admin interface for managing certifications with filters, stats, and placeholder handlers.",
  "frontend/src/components/admin/CompanyPagesTab.tsx": "Admin UI for reviewing and moderating company pages with search, filters, and status actions.",
  "frontend/src/components/admin/SystemAnalyticsTab.tsx": "Admin placeholder UI for future system-wide analytics and performance metrics.",
  "frontend/src/components/admin/UserManagementTab.tsx": "Admin placeholder UI for browsing and managing users.",
  "frontend/src/components/AIChatAssistant.tsx": "Interactive AI chat assistant component with role‑based welcome messages, quick actions, and message handling.",
  "frontend/src/components/candidate/AnalyticsTab.tsx": "Empty file with no implementation.",
  "frontend/src/components/candidate/CandidateInterviewsTab.tsx": "Empty file with no implementation.",
  "frontend/src/components/candidate/CareerPathTab.tsx": "Displays career path recommendations, triggers generation of mock data, and shows loading or empty states.",
  "frontend/src/components/candidate/CertificationsTab.tsx": "Shows earned certifications and progress toward in-progress certifications using placeholder data.",
  "frontend/src/components/candidate/FeedbackViewTab.tsx": "Empty placeholder component.",
  "frontend/src/components/candidate/GrowthTrackerTab.tsx": "Displays candidate growth metrics and learning progress with progress cards and summaries.",
  "frontend/src/components/candidate/JobRecommendationsTab.tsx": "Empty placeholder component.",
  "frontend/src/components/candidate/JobSearchTab.tsx": "Implements a job search interface with filters for experience, salary, and rating, showing search results.",
  "frontend/src/components/candidate/MyApplicationsTab.tsx": "Empty placeholder component.",
  "frontend/src/components/candidate/MyProfileTab.tsx": "Empty placeholder component.",
  "frontend/src/components/candidate/ResumeAnalysisTab.tsx": "Shows resume analysis loading, feature notice, and empty state using backend hooks.",
  "frontend/src/components/candidate/SkillTestsTab.tsx": "Empty placeholder component.",
  "frontend/src/components/candidate/TakeTestModal.tsx": "Empty placeholder component.",
  "frontend/src/components/employer/AIInsightsTab.tsx": "Displays mock hiring analytics, charts, and AI recommendations with a timeframe selector.",
  "frontend/src/components/employer/AnalyticsTab.tsx": "Empty placeholder component.",
  "frontend/src/components/employer/ApplicationsTab.tsx": "Empty placeholder component.",
  "frontend/src/components/employer/AssessmentsTab.tsx": "Empty placeholder component.",
  "frontend/src/components/employer/CandidatesTab.tsx": "UI for searching, filtering, sorting, and viewing detailed growth and career path data for candidates.",
  "frontend/src/components/employer/CompanyBrandingTab.tsx": "Form for employers to create or update company branding, including name, description, location, website, logo, and banner uploads.",
  "frontend/src/components/employer/CreateAssessmentModal.tsx": "Empty placeholder file for an assessment creation modal.",
  "frontend/src/components/employer/CreateJobModal.tsx": "Empty placeholder file for a job creation modal.",
  "frontend/src/components/employer/EditInterviewModal.tsx": "Empty placeholder file for an interview edit modal.",
  "frontend/src/components/employer/EditJobModal.tsx": "Empty placeholder file for a job edit modal.",
  "frontend/src/components/employer/FeedbackModal.tsx": "Empty placeholder file for a feedback modal.",
  "frontend/src/components/employer/InterviewsTab.tsx": "Empty placeholder for an employer interviews tab.",
  "frontend/src/components/employer/JobListingsTab.tsx": "Empty placeholder for an employer job listings tab.",
  "frontend/src/components/employer/RecommendationsTab.tsx": "Empty placeholder for AI or candidate recommendations tab.",
  "frontend/src/components/employer/ScheduleInterviewModal.tsx": "Empty placeholder for an interview scheduling modal.",
  "frontend/src/components/employer/TestResultsModal.tsx": "Empty placeholder for a test results modal.",
  "frontend/src/components/Footer.tsx": "Renders a footer with a copyright notice and a link to caffeine.ai, including a heart icon.",
  "frontend/src/components/Header.tsx": "Implements the main header with login/logout handling, user info display, theme toggle, and optional simulation button for admins.",
  "frontend/src/components/LeaderboardTab.tsx": "Displays the leaderboard with filtering, sorting, badge icons, and highlights the current user's ranking.",
  "frontend/src/components/LearningHubTab.tsx": "Shows learning resources with search, category filtering, progress tracking, and actions to save or complete items.",
  "frontend/src/components/MessagesTab.tsx": "Empty placeholder component file.",
  "frontend/src/components/NotificationDropdown.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileCustomizationTab.tsx": "Provides UI for editing profile customization including bio, contact info, and profile picture upload with validation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal shown on first use to collect basic profile details and role, then save them via a mutation.",
  "frontend/src/components/ReferralsTab.tsx": "UI for viewing referral stats and list, creating referrals, and showing implementation placeholder.",
  "frontend/src/components/SimulationMode.tsx": "Empty file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor instance tied to Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identity loading, and authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Centralized react-query wrappers and TypeScript models for backend operations related to users, jobs, candidates, and learning data.",
  "frontend/src/index.css": "Tailwind CSS base setup defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point that sets up React Query, Internet Identity provider, and mounts the application.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard with tabbed navigation for managing users, analytics, activity, company pages, AI insights, and certifications.",
  "frontend/src/pages/CandidateDashboard.tsx": "Defines a candidate dashboard with tabbed navigation for learning, growth tracking, career path, certifications, leaderboard, resume analysis, referrals, and profile customization.",
  "frontend/src/pages/EmployerDashboard.tsx": "Defines an employer dashboard with tabbed sections for learning, leaderboard, AI insights, company branding, referrals, and profile customization.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with hero section, featured companies list, and platform feature highlights, using login and company page data.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, features, and pending requests focused on adding and persisting user profile pictures."
}