{
  "backend/career-path.mo": "Defines data types for career paths, user roles, learning resources, analytics, gamification, profiles, interviews, assessments, and job recommendations.",
  "backend/main.mo": "Main actor defining user profiles, job listings, applications, messaging, notifications, simulations, and integrations with storage and authorization.",
  "feature_evidence.json": "Lists feature evidence entries linking features to affected files, components, tests, and associated metadata.",
  "frontend-file-summaries.txt": "Provides summaries of key frontend files describing their roles in authentication, dashboards, UI components, and data flow.",
  "frontend/index.css": "Tailwind CSS configuration defining global styles, theme variables, and dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Handles authentication flow, profile loading, conditional routing, and global providers for the React app.",
  "frontend/src/components/admin/ActivityMonitorTab.tsx": "Admin tab with layout and placeholders for real‑time activity logs and recent events.",
  "frontend/src/components/admin/AdminAIInsightsTab.tsx": "Admin analytics tab rendering mock AI insights with charts and timeframe selector; backend integration pending.",
  "frontend/src/components/admin/CertificationsTab.tsx": "Admin UI for viewing, filtering, and managing certifications using placeholder data and actions.",
  "frontend/src/components/admin/CompanyPagesTab.tsx": "Admin interface for reviewing, filtering, and moderating company pages with basic status controls and placeholder notice.",
  "frontend/src/components/admin/SystemAnalyticsTab.tsx": "Admin tab showing placeholder UI for upcoming system analytics and platform metrics.",
  "frontend/src/components/admin/UserManagementTab.tsx": "Admin tab containing placeholders for user directory and management features.",
  "frontend/src/components/AIChatAssistant.tsx": "Implements an AI chat assistant with role-specific messages, quick actions, and interactive conversation logic using user profile data.",
  "frontend/src/components/candidate/AnalyticsTab.tsx": "Empty file with no implemented content.",
  "frontend/src/components/candidate/CandidateInterviewsTab.tsx": "File contains no visible content in provided snippet.",
  "frontend/src/components/candidate/CareerPathTab.tsx": "UI component that fetches and displays personalized career path recommendations and allows generating new ones.",
  "frontend/src/components/candidate/CertificationsTab.tsx": "Displays earned certifications and progress toward new ones using placeholder data.",
  "frontend/src/components/candidate/FeedbackViewTab.tsx": "Empty placeholder file for a feedback view tab.",
  "frontend/src/components/candidate/GrowthTrackerTab.tsx": "Shows candidate growth metrics, overall progress, and learning statistics from backend queries.",
  "frontend/src/components/candidate/JobRecommendationsTab.tsx": "Empty placeholder for job recommendations UI.",
  "frontend/src/components/candidate/JobSearchTab.tsx": "Job search interface with filters for experience, salary, and rating, displaying matched job results.",
  "frontend/src/components/candidate/MyApplicationsTab.tsx": "Empty placeholder for viewing a candidate’s job applications.",
  "frontend/src/components/candidate/MyProfileTab.tsx": "Empty placeholder for profile management UI.",
  "frontend/src/components/candidate/ResumeAnalysisTab.tsx": "Loads resume analysis data and shows a notice that the feature is still under development.",
  "frontend/src/components/candidate/SkillTestsTab.tsx": "Empty placeholder for skill tests UI.",
  "frontend/src/components/candidate/TakeTestModal.tsx": "Empty placeholder for a modal used to take tests.",
  "frontend/src/components/employer/AIInsightsTab.tsx": "Displays employer analytics with charts and mock AI insights about hiring performance.",
  "frontend/src/components/employer/AnalyticsTab.tsx": "Empty placeholder for analytics UI.",
  "frontend/src/components/employer/ApplicationsTab.tsx": "Empty placeholder for managing job applications.",
  "frontend/src/components/employer/AssessmentsTab.tsx": "Empty placeholder for employer assessments UI.",
  "frontend/src/components/employer/CandidatesTab.tsx": "Component for searching, filtering, and displaying candidates with growth and career path summaries.",
  "frontend/src/components/employer/CompanyBrandingTab.tsx": "UI for creating and updating a company page, including logo and banner uploads.",
  "frontend/src/components/employer/CreateAssessmentModal.tsx": "Empty placeholder file for assessment creation modal.",
  "frontend/src/components/employer/CreateJobModal.tsx": "Empty placeholder file for job creation modal.",
  "frontend/src/components/employer/EditInterviewModal.tsx": "Empty placeholder file for editing interviews.",
  "frontend/src/components/employer/EditJobModal.tsx": "Empty placeholder file for editing job listings.",
  "frontend/src/components/employer/FeedbackModal.tsx": "Empty placeholder file for submitting or viewing candidate feedback.",
  "frontend/src/components/employer/InterviewsTab.tsx": "Empty placeholder file for employer interview management tab.",
  "frontend/src/components/employer/JobListingsTab.tsx": "Empty placeholder file for employer job listings tab.",
  "frontend/src/components/employer/RecommendationsTab.tsx": "Empty placeholder file for candidate recommendations tab.",
  "frontend/src/components/employer/ScheduleInterviewModal.tsx": "Empty placeholder file for scheduling interviews.",
  "frontend/src/components/employer/TestResultsModal.tsx": "Empty placeholder file for displaying candidate test results.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, authentication controls, user profile info, theme switcher, and optional admin simulation button.",
  "frontend/src/components/LeaderboardTab.tsx": "Shows a leaderboard with filtering, sorting, badge visuals, and highlights the current user’s ranking.",
  "frontend/src/components/LearningHubTab.tsx": "Provides a searchable and filterable list of learning resources with progress tracking and save/complete actions.",
  "frontend/src/components/MessagesTab.tsx": "Empty placeholder component for a messages tab.",
  "frontend/src/components/NotificationDropdown.tsx": "Empty placeholder component for a notification dropdown.",
  "frontend/src/components/ProfileCustomizationTab.tsx": "Lets users update bio, contact info, and upload a profile picture with progress tracking.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial profile setup collecting name, email, and role before saving the user profile.",
  "frontend/src/components/ReferralsTab.tsx": "Referral dashboard showing stats, referral list, and creation flow using query hooks; feature is mostly placeholder with UI elements.",
  "frontend/src/components/SimulationMode.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the backend actor based on authenticated identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks and type definitions for fetching and mutating backend data related to jobs, candidates, and career progress.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard with tabbed navigation for managing users, analytics, activity, company pages, AI insights, and certifications.",
  "frontend/src/pages/CandidateDashboard.tsx": "Renders a tabbed candidate dashboard with sections for learning, growth tracking, career path, certifications, leaderboard, resume analysis, referrals, and profile customization.",
  "frontend/src/pages/EmployerDashboard.tsx": "Provides a tabbed employer dashboard with learning resources, leaderboard, AI insights, branding, referrals, and profile customization.",
  "frontend/src/pages/LandingPage.tsx": "Displays the public landing page with hero content, featured companies, and feature highlights, using Internet Identity login and company page data.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, persisting, and clearing URL and session-based parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration that defines theming, OKLCH color system, container settings, animations, and plugin integration.",
  "project_state.json": "Project state file describing current features, versions, and scope of the JobConnect platform."
}