{
  "kind": "build_request",
  "title": "Add profile picture support for user profiles",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Persist each authenticated user’s profile picture selection in the backend user profile record (stored per caller Principal) so it is returned by getCallerUserProfile() after being saved via setProfileCustomization().",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add the feature of profile picture"
        ]
      },
      "acceptanceCriteria": [
        "When the caller saves a profile picture via setProfileCustomization(profilePictureRef = some blob ref), subsequent getCallerUserProfile() calls return customization.profilePicture = that same blob reference.",
        "When the caller removes their profile picture and saves (profilePictureRef = null), subsequent getCallerUserProfile() calls return customization.profilePicture = null.",
        "The profile picture reference is stored in stable state so it survives canister upgrades."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Profile Customization UI flow so users can upload, preview, remove, and save a profile picture, and the saved value reloads correctly from getCallerUserProfile().",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add the feature of profile picture"
        ]
      },
      "acceptanceCriteria": [
        "The Profile Customization screen allows selecting an image file, shows a preview avatar, and blocks non-image files and images larger than 5MB with clear error messaging.",
        "Clicking “Remove” clears the preview and, after clicking “Save Changes”, the backend is updated so reloading the page shows the fallback avatar (initials) again.",
        "After successfully saving, the UI reflects the persisted profile picture by reloading/refreshing the current user profile query state (no manual refresh required)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Show the current user’s profile picture (or initials fallback) in the main authenticated app header wherever the signed-in user identity is displayed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add the feature of profile picture"
        ]
      },
      "acceptanceCriteria": [
        "When the current user has a saved profile picture, the header displays it as an avatar image.",
        "When the user has no saved profile picture, the header displays a fallback avatar with the user’s initials.",
        "Updating the profile picture via the Profile Customization screen causes the header avatar to update after save (within the normal React Query refresh/invalidation flow)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit any files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT; compose those components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Building a public user directory or viewing other users’ profile pictures.",
    "Third-party image hosting, external databases, or external auth providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}