{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Profile picture upload, persistence refresh, and header avatar rendering",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Enhance Profile Customization to upload/preview/remove/save a profile picture with validation and automatic reload from the current user profile query.",
      "acceptanceCriteria": [
        "The Profile Customization screen allows selecting an image file, shows a preview avatar, and blocks non-image files and images larger than 5MB with clear error messaging.",
        "Clicking “Remove” clears the preview and, after clicking “Save Changes”, the backend is updated so reloading the page shows the fallback avatar (initials) again.",
        "After successfully saving, the UI reflects the persisted profile picture by reloading/refreshing the current user profile query state (no manual refresh required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileCustomizationTab.tsx",
          "operation": "modify",
          "description": "Update the profile picture section to use the blob-storage ExternalBlob capability for image upload/preview via getDirectURL(), add inline (non-alert) validation errors for non-image files and >5MB images, ensure remove+save sends a cleared picture value, and ensure local state fully re-syncs from getCallerUserProfile() (including clearing state when no picture is returned). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align the profile customization mutation types/payload with the generated backend types, and ensure React Query invalidation/refetch of ['currentUserProfile'] happens on success so the saved profile picture reloads into the UI state. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Render the current user’s avatar in the authenticated header using the saved profile picture (or initials fallback) and update it after profile changes through query refresh.",
      "acceptanceCriteria": [
        "When the current user has a saved profile picture, the header displays it as an avatar image.",
        "When the user has no saved profile picture, the header displays a fallback avatar with the user’s initials.",
        "Updating the profile picture via the Profile Customization screen causes the header avatar to update after save (within the normal React Query refresh/invalidation flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure the header avatar uses the profile picture direct URL when present and otherwise reliably falls back to initials, and that it reflects updates after Profile Customization saves via the existing React Query current user profile refresh flow. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}